static/presentations/2019-07-23/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Xonsh, Nix, &amp; Limma</title>
<meta name="author" content="(Edmund Miller)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/theme/white.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">

<section>
<section id="slide-org43383b4">
<h2 id="org43383b4">Xonsh</h2>
<div class="outline-text-2" id="text-org43383b4">
</div>
</section>
<section id="slide-org0f2ffa3">
<h3 id="org0f2ffa3">SciPy 2019</h3>
<div class="outline-text-3" id="text-org0f2ffa3">
</div>
</section>
<section id="slide-org6fe3147">
<h4 id="org6fe3147">Links</h4>
<div class="outline-text-4" id="text-org6fe3147">
</div>
<ul class="org-ul">
<li><a id="org6b9e97f"></a><a href="http://conference.scipy.org/">Conference List</a><br /></li>
<li><a id="org5f2aed1"></a><a href="https://xonsh.github.io/scipy-2019-tutorial/#1">Xonsh Tutorial</a><br /></li>
<li><a id="orgfd909c4"></a><a href="https://youtu.be/ujo9sbqHFqw?list=PLYx7XA2nY5GcDQblpQ_M1V3PQPoLWiDAC">Xonsh Talk</a><br /></li>
<li><a id="orgc798dfb"></a><a href="https://www.youtube.com/watch?v=ZB7BZMhfPgk&amp;list=PLYx7XA2nY5GcDQblpQ_M1V3PQPoLWiDAC">Talk Playlist</a><br /></li>
</ul>
</section>
</section>
<section>
<section id="slide-org877626e">
<h2 id="org877626e">Nix</h2>
<div class="outline-text-2" id="text-org877626e">
</div>
</section>
<section id="slide-org9a51871">
<h3 id="org9a51871">Code as Infastructure</h3>
<ul>
<li><a href="https://nixos.org/~eelco/pubs/nixos-jfp-final.pdf">NixOS: A Purely Functional Linux Distribution</a></li>

</ul>
</section>
<section id="slide-org82c331b">
<h3 id="org82c331b">A Couple of Different Things</h3>
<ul>
<li>Nix Programming Language</li>
<li>NIx Package Manager</li>
<li>NixOS</li>
<li><a href="https://www.youtube.com/watch?v=USDbjmxEZ_I&amp;list=PLYx7XA2nY5GcDQblpQ_M1V3PQPoLWiDAC&amp;index=16">SciPy Talk</a></li>

</ul>
</section>
<section id="slide-org876a173" data-background="img/HowNix.png" data-background-size="800px" data-background-transition="slide">
<h3 id="org876a173"></h3>
</section>
<section id="slide-org8936769">
<h3 id="org8936769">Simple Derivation</h3>
<div class="org-src-container">

<pre  class="src src-sh"><code trim><span style="color: #c678dd;">declare</span> -xp
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">PATH</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">coreutils</span><span style="color: #98be65;">/bin"</span>
<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"hello"</span>
<span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">blah</span>
<span style="color: #dcaeea;">dest</span>=$<span style="color: #dcaeea;">out</span>/bin
<span style="color: #ECBE7B;">mkdir</span> -p $<span style="color: #dcaeea;">dest</span>
<span style="color: #ECBE7B;">cp</span> $<span style="color: #dcaeea;">src</span> $<span style="color: #dcaeea;">dest</span>/my-hello
</code></pre>
</div>
</section>
<section id="slide-orge22a395">
<h3 id="orge22a395">Simple Derivation</h3>
<div class="org-src-container">

<pre  class="src src-nix"><code trim><span style="color: #51afef;">with</span> (<span style="color: #c678dd;">import</span> <span style="color: #a9a1e1;">&lt;nixpkgs&gt;</span> {});
<span style="color: #c678dd;">derivation</span> {
  <span style="color: #dcaeea;">name</span> = <span style="color: #98be65;">"my_hello"</span>;
  <span style="color: #dcaeea;">builder</span> = <span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">${</span>bash<span style="color: #51afef; font-weight: bold;">}</span><span style="color: #98be65;">/bin/bash"</span>;
  <span style="color: #dcaeea;">args</span> = [ <span style="color: #a9a1e1;">./build.sh</span> ];
  <span style="color: #dcaeea;">system</span> = builtins.currentSystem;
  <span style="color: #dcaeea;">coreutils</span> = coreutils;
  <span style="color: #dcaeea;">src</span> = <span style="color: #a9a1e1;">./my-hello</span>;
  <span style="color: #dcaeea;">blah</span> = <span style="color: #a9a1e1;">./blah</span>;
}
</code></pre>
</div>
</section>
<section id="slide-org84e82a8">
<h3 id="org84e82a8">My Config</h3>
</section>
<section id="slide-org467ae8b">
<h3 id="org467ae8b">Python and Nix</h3>
<div class="outline-text-3" id="text-org467ae8b">
</div>
</section>
<section id="slide-orgff64584">
<h4 id="orgff64584">Imperative Installation</h4>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>$ nix-env -i hello
$ nix-env --list-generations
$ nix-env --rollback
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">View environment dependencies</span>
$ nix-env -q
</code></pre>
</div>
</section>
<section id="slide-org73ab51a">
<h4 id="org73ab51a">nix-shell</h4>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>$ nix-shell --pure -p python27 -p python27Packages.numpy
</code></pre>
</div>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>$ python -c <span style="color: #98be65;">"import numpy"</span>
$ <span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">PYTHONPATH</span>
</code></pre>
</div>
</section>
<section id="slide-orgb87bb90">
<h4 id="orgb87bb90">Repeatable Environment</h4>
<div class="org-src-container">

<pre  class="src src-nix"><code trim><span style="color: #5B6268;"># </span><span style="color: #5B6268;">shell.nix</span>
<span style="color: #51afef;">let</span>
  <span style="color: #dcaeea;">nixpkgs</span> = <span style="color: #c678dd;">import</span> <span style="color: #a9a1e1;">&lt;nixpkgs&gt;</span> {};
  <span style="color: #dcaeea;">pypkgs</span> = nixpks.python36Packages;
<span style="color: #51afef;">in</span>
  (pypkgs.python.withPackages (x: [ x.numpy x.scipy])).env
</code></pre>
</div>
<ul>
<li>Can also prevent version drift</li>

</ul>
</section>
<section id="slide-org0ed8a41">
<h4 id="org0ed8a41">buildPythonPackage</h4>
<div class="org-src-container">

<pre  class="src src-nix"><code trim>{ nixpkgs, pypkgs }:
pypkgs.buildPythonPackage <span style="color: #51afef;">rec</span> {
  <span style="color: #dcaeea;">pname</span> = <span style="color: #98be65;">"scipy"</span>;
  <span style="color: #dcaeea;">version</span> = <span style="color: #98be65;">"0.19.1"</span>;
  <span style="color: #dcaeea;">src</span> = pypkgs.fetchPypi {
    <span style="color: #51afef;">inherit</span> pname version;
    <span style="color: #dcaeea;">sha256</span> = <span style="color: #98be65;">"1rl411bvla6q7qfdb47fpdnyjhfgzl6smpha33n9ar1klykjr6m1"</span>;
  };
  <span style="color: #dcaeea;">buildInputs</span> = [
    pypkgs.numpy
    nixpkgs.pkgs.gcc
    nixpkgs.pkgs.gfortran
  ];
  <span style="color: #dcaeea;">ignoreCollisions</span>=true;
  <span style="color: #dcaeea;">catchConflicts</span>=false;
  <span style="color: #dcaeea;">doCheck</span> = <span style="color: #c678dd;">false</span>;
}
</code></pre>
</div>
<ul>
<li>Fetch from PyPi</li>
<li>Specify build time, run time, tests, dependancies</li>
<li>Runs <code>setup.py install</code> or <code>setup.py develop</code></li>

</ul>
</section>
<section id="slide-org05594c3">
<h4 id="org05594c3">PyPi2Nix</h4>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>$ pypi2nix -V <span style="color: #98be65;">"3.6"</span> -r requirements.txt
$ nix-shell --pure requirements.nix
</code></pre>
</div>
<ul>
<li>Doesn&rsquo;t matter if packages aren&rsquo;t in nix packages</li>

</ul>
</section>
</section>
<section>
<section id="slide-org5d7b301">
<h2 id="org5d7b301">eRNA Prediction Pipeline from GRO-Seq INFB1 Induction Timecourse</h2>
<div class="outline-text-2" id="text-org5d7b301">
</div>
</section>
<section id="slide-orgaf610a2">
<h3 id="orgaf610a2">Recap</h3>
<div class="outline-text-3" id="text-orgaf610a2">
</div>
</section>
<section id="slide-org047bd8d" data-background="img/globaltrans.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org047bd8d"></h4>
</section>
<section id="slide-org995df97">
<h4 id="org995df97">Overview</h4>
<ul>
<li>Reproducing GM18</li>
<li>Predicted IMR90 eRNAs</li>
<li>Compared IMR90 Predicted Enhancers to GM</li>
<li>Used Homer scripts to find DE of eRNAs and Genes</li>
<li>Gene Centric vs. Enhancer Centric</li>

</ul>
</section>
<section id="slide-orgd6f485d">
<h4 id="orgd6f485d">Reproducing GM18</h4>
<ul>
<li>hg18 vs hg19</li>
<li>Overpredicting eRNA transcripts</li>
<li>Past Issue
<ul>
<li>What I thought Peng sent me</li>
<li>hg18 -&gt; eRNAs -&gt; Me</li>
<li>What actually happened</li>
<li>hg18 -&gt; eRNAs -&gt; LiftOver -&gt; hg19 -&gt; Me</li>

</ul></li>
<li>Main issue is homer uniqmap</li>

</ul>
</section>
<section id="slide-orgc329c85" data-background="img/Figure_1.png" data-background-size="800px" data-background-transition="slide">
<h4 id="orgc329c85"></h4>
</section>
<section id="slide-orga88f53b" data-background="img/Figure_2.png" data-background-size="800px" data-background-transition="slide">
<h4 id="orga88f53b"></h4>
</section>
<section id="slide-orgb86b47e" data-background="img/dag.png" data-background-size="400px" data-background-transition="slide">
<h4 id="orgb86b47e"></h4>
</section>
<section id="slide-orgebd418a">
<h4 id="orgebd418a">Actual Pipelines</h4>
<div class="outline-text-4" id="text-orgebd418a">
</div>
<ul class="org-ul">
<li><a id="org18a1ff3"></a><a href="files/GM18dag.pdf">GM18</a><br /></li>
<li><a id="orgf98caa4"></a><a href="files/IMR19dag.pdf">IMR19</a><br /></li>
<li><a id="orgc05fc17"></a><a href="files/all.pdf">All</a><br /></li>
</ul>
</section>
<section id="slide-orga00dd90">
<h4 id="orga00dd90">Predicted IMR90 eRNAs</h4>
<p>
Changes from GM18
</p>
<ul>
<li>hg19</li>
<li>No liftover</li>

</ul>
</section>
<section id="slide-org8a97faf">
<h4 id="org8a97faf">Compared IMR90 Predicted Enhancers to GM</h4>
</section>
<section id="slide-org9ae6b6b" data-background="img/Venn.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org9ae6b6b"></h4>

</section>
<section id="slide-org5747d53">
<h4 id="org5747d53">Used Homer scripts to find DE of eRNAs and Genes</h4>
</section>
<section id="slide-orgcda9b25">
<h4 id="orgcda9b25">Gene Centric vs. Enhancer Centric</h4>
<ul>
<li>Peng&rsquo;s approach
<ul>
<li>Took enhancers that were expressed deferentially</li>
<li>Linked them to Genes within 200Kb</li>

</ul></li>
<li>New approach
<ul>
<li>Take genes that are deferentially expressed</li>
<li>Link the Enhancers to those genes</li>

</ul></li>

</ul>

</section>
<section id="slide-org3bd3a8a" data-background="viz/pipeline.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org3bd3a8a"></h4>
</section>
<section id="slide-org390c8fe">
<h4 id="org390c8fe">featureCounts</h4>
<div class="outline-text-4" id="text-org390c8fe">
</div>
<ul class="org-ul">
<li><a id="org788433f"></a>Tried CLI version<br /></li>
<li><a id="org066c395"></a>Couldn&rsquo;t get examples to work with edgeR<br /></li>
<li><a id="orgc346794"></a>Switched to R package<br /></li>
<li><a id="org65fa0a6"></a>Update: switched back<br /></li>
</ul>
</section>
<section id="slide-org863b7c2">
<h3 id="org863b7c2">New Things</h3>
<div class="outline-text-3" id="text-org863b7c2">
</div>
</section>
<section id="slide-orgf7a6e69">
<h4 id="orgf7a6e69">Shayne Easterwood</h4>
<ul>
<li>NOISeq Analysis</li>
<li>SAF Format for eRNA formats</li>
<li>A chance to clean up</li>

</ul>
</section>
<section id="slide-org973446e">
<h4 id="org973446e">Linear Model / Time Series Analysis</h4>
</section>
<section id="slide-org5446bae">
<h4 id="org5446bae">Limma</h4>
<ul>
<li><a href="https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4937821/">RNA-seq analysis is easy as 1-2-3 with limma, Glimma and edgeR</a></li>
<li><a href="http://bioinf.wehi.edu.au/folders/limmaWorkflow/glimma-plots/MDS-Plot.html">glimma Plots</a></li>

</ul>
</section>
<section id="slide-org0294d53" data-background="img/limma/GM19_fig1_limma.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org0294d53"></h4>
</section>
<section id="slide-org78e7a9d" data-background="img/limma/IMR_fig1_limma.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org78e7a9d"></h4>
</section>
<section id="slide-org0f95a9a" data-background="img/limma/GM19_fig2_limma.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org0f95a9a"></h4>
</section>
<section id="slide-org1823c2f" data-background="img/limma/IMR_fig2_limma.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org1823c2f"></h4>
</section>
<section id="slide-orga98a1be" data-background="img/limma/GM19_fig3_limma.png" data-background-size="800px" data-background-transition="slide">
<h4 id="orga98a1be"></h4>
</section>
<section id="slide-org092b11e" data-background="img/limma/IMR_fig3_limma.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org092b11e"></h4>
</section>
<section id="slide-org93fb1f1">
<h4 id="org93fb1f1">Future</h4>
<ul>
<li>Get List of Top Genes</li>
<li>Link eRNAs and Top genes</li>
<li>Compare IMR and GM Genes</li>
<li>Kinetics of the eRNAs</li>

</ul>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
